sdaiPutADBTypePath(Sdai_ADBId*,System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte**)
\details
Sets the data_type value of the specified ADB with the EXPRESS TYPE names in the specified vector
\param block [in] ADB instance
\param typeNameNumber [in] is a size of typeNameVector
\param typeNameVector [in] array of type pathes